Revit 2027 API
BuiltInFailures.GlobalParameterFailures.ElementPropLinkCircularChain Property
 Linked properties in highlighted elements cause a circular chain of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementPropLinkCircularChain { get; }
Public Shared ReadOnly Property ElementPropLinkCircularChain As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementPropLinkCircularChain {
	FailureDefinitionId^ get ();
}
static member ElementPropLinkCircularChain : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace